// 初始化地图
var map = new ol.Map({
    target: 'map',
    layers: [
        new ol.layer.Tile({
            source: new ol.source.XYZ({
                url: 'http://t0.tianditu.gov.cn/vec_w/wmts?SERVICE=WMTS&REQUEST=GetTile&VERSION=1.0.0&LAYER=vec&STYLE=default&TILEMATRIXSET=w&FORMAT=tiles&TILEMATRIX={z}&TILEROW={y}&TILECOL={x}&tk=b9031f80391e6b65bd1dd80dcde1b097'
            })
        }),
        new ol.layer.Tile({
            source: new ol.source.XYZ({
                url: 'http://t0.tianditu.gov.cn/cva_w/wmts?SERVICE=WMTS&REQUEST=GetTile&VERSION=1.0.0&LAYER=cva&STYLE=default&TILEMATRIXSET=w&FORMAT=tiles&TILEMATRIX={z}&TILEROW={y}&TILECOL={x}&tk=b9031f80391e6b65bd1dd80dcde1b097'
            })
        })
    ],
    view: new ol.View({
        center: ol.proj.fromLonLat([106.1554, 35.8617]),
        zoom: 5
    })
});

const points = [
    [112.84437, 34.16717],
    [119.43157, 32.39463],
    [119.14168, 28.07434],
    [113.48794, 34.14048],
    [114.74501, 38.62231],
    [117.18366, 29.27324],
    [109.030914, 35.004681],
    [114.37392, 36.37396],
    [114.507132, 37.06787],
    [115.77121, 28.1592],
    [112.904022, 28.37244],
    [116.83359, 32.63142],
    [119.14168, 28.07434],
]

const cameraStyle = new ol.style.Style({
    image: new ol.style.Icon({
      src: '../img/icon.png',
      imgsize: [1, 1],
      anchor: [0.5, 0.5],
    })
  });


function addCameraFeature(points) {
    const cameraSource = new ol.source.Vector();
    points.forEach(coordinates => {
      const pointGeometry = new ol.geom.Point(ol.proj.fromLonLat(coordinates, 'EPSG:3857'));
      const pointFeature = new ol.Feature({
        geometry: pointGeometry,
      });
      pointFeature.setStyle(cameraStyle);
      cameraSource.addFeature(pointFeature);
    });

    const cameraLayer = new ol.layer.Vector({
      source: cameraSource,
    });
    map.addLayer(cameraLayer)
}

addCameraFeature(points);

// 获取所有列表元素
var gridItems = document.querySelectorAll('.grid-item');
var introPage = document.querySelector('.intro-page');
var introImage = introPage.querySelector('img');
var introP = introPage.querySelector('p')
var introH = introPage.querySelector('h')

var dictionary = {
    "哥窑": "纹取冰裂、鳝血为上，梅花片、墨纹次之，细碎纹，纹之下也。哥窑胎多紫黑色、铁黑色、也有黄褐色。釉为失透的乳浊釉，釉面泛一层酥光，釉色以炒米黄、灰青多见，釉面大小纹片结合。经染色后大纹片呈深褐色，小纹片为黄褐色，也称‘金丝铁线’“墨纹梅花片”“叶脉纹”‘文武片’等。这是传世哥窑的主要特征之一。器形有各式瓶、炉、尊、洗及碗、盆、碟等。多见仿古造型，底足制作不十分规整，釉面常见缩釉和棕眼。",
    "官窑": "官瓷重楷模，精华四海粹。南宋官窑瓷器沿袭北宋风格，规整对称，宫廷气势，高雅大气，一丝不苟。因为胎土含铁量极高，手感沉重，胎土呈深黑褐色，后称“紫口铁足”。釉面沉重幽亮，釉厚如堆脂，温润如玉。釉面多层反复细刮，釉光下沉而不刺眼，纹理布局规则有致，造型庄重大方。",
    "定窑": "釉色透明，柔润媲玉。定窑产品以白瓷为主，也烧制酱、红、黑等其他名贵品种，如黑釉（黑定）、紫釉（紫定）、绿釉（绿定）、红釉（红定）等，都是在白瓷胎上，罩上一层高温色釉。元朝刘祁的《归潜志》说，“定州花瓷瓯，颜色天下白”。 可见，定窑器在当时不仅深受人们喜爱，而且产量较大。宋代大诗人苏东坡在定州时，曾用“定州花瓷琢红玉”的诗句，来赞美定窑瓷器的绚丽多彩。",
    "景德镇窑": "白如玉，明如镜，薄如纸，声如磬。景德镇窑自唐代起即烧制青瓷，至北宋时以烧制青白瓷为主。其瓷釉色白而略带青色，这种白中泛青、青中见白的色釉,为景德镇窑的新创,其色调给人以清新爽快之感。青白瓷以光素者居多，亦间有刻花者。青白釉瓷器的釉质透明如水，胎体质薄轻巧，青白的瓷釉罩在刻花、印花的器皿上，纹样的凹下处积釉稍厚而较青，胎薄的花纹在迎光下若隐若现，故又有影青、映青、隐青、罩青之称。",
    "汝窑": "雨过天晴云破处 这般颜色做将来。汝瓷造型古朴大方，以名贵玛瑙为釉，色泽独特，有“玛瑙为釉古相传”的赞誉。随光变幻，观其釉色，犹如“雨过天晴云破处”，“千峰碧波翠色来”之美妙，土质细润，坯体如侗体其釉厚而声如磬，明亮而不刺目。器表呈蝉翼纹细小开片，有“梨皮、蟹爪、芝麻花”之特点，被世人称为“似玉、非玉、而胜玉”。宋、元、明、清以来，宫廷汝瓷用器，内库所藏，视若珍宝、可与商彝周鼎比贵。",
    "磁州窑": "黑白对比，强烈鲜明。磁州窑的匠师们吸收了传统的水墨画和书法艺术的技法，创造了具有水墨画风的白底黑绘装饰艺术，开启了中国瓷器彩绘装饰的先河。磁州窑品种诸多，以白地黑花（铁锈花）、刻划花、窑变黑釉最为著名。它的装饰技法突破了当时流行的五大名（官）窑（汝、官、钧、哥、定）的单色釉局限，运用了数十种丰富多彩的装饰技法。磁州窑是中国著名的民间陶瓷窑系，是北方陶瓷的代表。素有“南有景德，北有彭城”之说。",
    "耀州窑": "以刀代笔，色泽青幽。耀窑，在西安耀州，亦宋时所建。初烧青器，仿汝而略逊，后烧白器较佳。初制者其釉透亮如玻璃，其色微黄，略似虾青色。后制者其釉略混，其色甚白，有似牛乳之白、有似粉油之白、有似熟菱米之白不等。耀州窑主要的装饰方法，主要有刻花、剔花、印花、镂空等。刻花是用工具在胎器上刻出花纹，花纹的线条呈斜面，称为“偏刀”，能在平面装饰上显现浅浮雕的立体层次效果。剔花是用工具剔去花纹之外的部分。印花是用印模在胎上印出花纹。镂空是雕出空洞。",
    "钧窑": "入窑一色、出窑万彩。钧窑瓷器胎质细腻，坚实致密，扣之有声，清脆动听，圆润悦耳，犹如金属，釉色莹润，五彩缤纷，古朴典雅，艳丽绝伦，尤以多种窑变为其他窑口产品所不及，釉色红里透紫，紫里藏青，青中寓白，白里泛红，色彩纷呈，争奇斗艳。古人有 “绿如春水初生日，红似朝霞欲上时”和“高山云雾霞一朵，烟光空中星满天;峡谷飞瀑兔丝缕，夕阳紫翠忽成岚”等诗句来形容钧瓷釉色的多样和窑变的微妙之美。",
    "邢窑": "邢窑器物造型朴素大方，线条饱满酣畅，制作规整精细，釉色银白恬静，给人以既雍容饱满而又凝重大方的美感。陆羽在《茶经》中曾对邢窑白瓷有过这样的评价：“邢瓷类银，越瓷类玉，邢瓷类雪，越瓷类冰”。白瓷的发明在中国制瓷史上具有划时代的意义，它不仅结束了自商朝以来青瓷独尊的局面，更重要的是为中国后世的花瓷生产尤其是彩瓷生产创造了条件。",
    "洪州窑": "从原材料和工艺来看，高铝低铁瓷土资源加上桶形匣钵的广泛使用，造就了胎质细腻、质地坚密、釉面光洁薄厚均匀的玻璃青釉瓷器。南朝时期的洪州窑青瓷，胎釉结合度很高，釉面透亮，质量堪称历代之最，不似两晋时期施釉不均、胎釉杂质多、生烧多，又不似隋唐时期施化妆土胎釉结合不好极易剥釉。南朝时期洪州窑青瓷盛行莲瓣纹造型，外腹壁剔刻具有浅浮雕效果的莲瓣纹，配以清澈明亮的青釉，既体现了南朝时期上到统治者下到老百姓崇佛礼佛的社会习俗，又体现了南朝门阀士族“秀骨清像”的审美情趣。",
    "长沙窑": "长沙窑擅长烧制青瓷，所制瓷器釉色多样，胎体饱满，器型秀美，具有极高的艺术价值，。尤其是长沙窑发展过程中，融汇南北工匠风格的彩瓷，更是唐朝众多瓷器中的宠儿，深受唐朝人民喜爱。在已经发现的长沙窑作品中，大多带有描绘唐朝生活风貌的文字或者唐诗，其中甚至还能看到当时的广告语，无论是百姓劳作耕种，还是市井商人贩卖货物，学者们都能寻找到相关的描述。这种充满生活气息的瓷器，显然更能抓住唐朝百姓的心。",
    "寿州窑": "寿州窑早期产品有罐、四系瓶、豆、盏等，多着淡青灰色釉、青釉，胎质较细。吸水率低，釉色青中带绿，系用还原焰烧成，釉层薄而透明，腹下部及底足不施釉。盛期产品有碗、盘、杯、钵、注子、枕、玩具等。釉色以氧化焰烧成，有蜡黄、鳝鱼黄、黄绿釉等。釉下施泥质胎衣，釉层呈玻璃状。寿州窑以中原文化为主，兼含南北方文化，并具有地方特色。",
    "龙泉窑": "龙泉窑系代表性釉色有粉青、豆青、梅子青、米黄、蜜蜡、芝麻酱、鹅皮黄和乌金等。龙泉窑釉色苍翠，北宋时多粉青色，南宋时呈葱青色，没有开片在器皿转折处，往往露胎呈现胎色，瓷釉厚润，装饰上很少刻花、划花，而流行用贴花、浮雕，例如在盘中常堆贴出双鱼图案，在瓶身上贴出缠枝牡丹图案。龙泉窑以烧制青瓷而闻名，在北宋早期以前的产品风格受越窑、瓯窑、婺州窑的影响，特征与三窑的产品相似。胎质较粗，胎体较厚，釉色淡青，釉层稍簿。",
}

var coords_dic = {
    "哥窑": [119.14168, 28.07434],
    "官窑": [119.43157, 32.39463],
    "定窑": [114.74501, 38.62231],
    "景德镇窑": [117.18366, 29.27324],
    "汝窑": [112.84437, 34.16717],
    "磁州窑": [114.37392, 36.37396],
    "耀州窑": [109.030914, 35.004681],
    "钧窑": [113.48794, 34.14048],
    "邢窑": [114.507132, 37.06787],
    "洪州窑": [115.77121, 28.1592],
    "长沙窑": [112.904022, 28.37244],
    "寿州窑": [116.83359, 32.63142],
    "龙泉窑":[119.14168, 28.07434],
}
// 遍历每个列表元素
gridItems.forEach(function(item) {
    // 添加点击事件
    item.addEventListener('click', function() {
        // 获取被点击图片的路径
        var imagePath = this.querySelector('img').src;
        var imagealt = this.querySelector('img').alt;

        introP.textContent = dictionary[imagealt]
        introH.textContent = imagealt
        // 将路径应用到介绍页面的图片上
        introImage.src = imagePath;

        // 显示介绍页面
        introPage.style.left = '0'; // 从左侧滑入
        let center = coords_dic[imagealt]
        panToCoordinate(ol.proj.fromLonLat(center, 'EPSG:3857'), 10)
    });
});

// 为返回按钮添加点击事件
var returnBtn = document.querySelector('.return-btn');
returnBtn.addEventListener('click', function() {
    // 隐藏介绍页面
    introPage.style.left = '-100%'; // 滑出到左侧
});

function panToCoordinate(coordinate, zoomLevel, duration = 1000) {
    map.getView().animate({
        center: coordinate,
        zoom: zoomLevel,
        duration: duration
    });
}